In [1]:
import pandas as pd
import numpy as np

### 设置数值

In [2]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20180330',periods=6))
s1

2018-03-30    1
2018-03-31    2
2018-04-01    3
2018-04-02    4
2018-04-03    5
2018-04-04    6
Freq: D, dtype: int64

可以看出pd的data函数在时间周期（比如闰年平年、闰月等）表示无误

In [3]:
df=pd.DataFrame(np.random.randn(6,4),index=pd.date_range('20180330',periods=6),columns=list('ABCD'))
df

                   A         B         C         D
2018-03-30  1.306003 -0.519418 -0.011686 -0.559511
2018-03-31  0.659329 -0.354700  0.884170 -1.152383
2018-04-01  0.189717 -1.320098 -2.332286  1.030536
2018-04-02 -0.295454  1.159584 -0.888303 -0.476288
2018-04-03 -0.864901 -0.496578 -0.359946 -0.902925
2018-04-04 -0.754733  0.785901  0.965455  0.671031

In [4]:
df['E']=s1
df

                   A         B         C         D  E
2018-03-30  1.306003 -0.519418 -0.011686 -0.559511  1
2018-03-31  0.659329 -0.354700  0.884170 -1.152383  2
2018-04-01  0.189717 -1.320098 -2.332286  1.030536  3
2018-04-02 -0.295454  1.159584 -0.888303 -0.476288  4
2018-04-03 -0.864901 -0.496578 -0.359946 -0.902925  5
2018-04-04 -0.754733  0.785901  0.965455  0.671031  6

In [5]:
df.at['20180403','E']=8 #通过标签
df

                   A         B         C         D  E
2018-03-30  1.306003 -0.519418 -0.011686 -0.559511  1
2018-03-31  0.659329 -0.354700  0.884170 -1.152383  2
2018-04-01  0.189717 -1.320098 -2.332286  1.030536  3
2018-04-02 -0.295454  1.159584 -0.888303 -0.476288  4
2018-04-03 -0.864901 -0.496578 -0.359946 -0.902925  8
2018-04-04 -0.754733  0.785901  0.965455  0.671031  6

In [6]:
df.iat[5,4]=10 #通过坐标
df

                   A         B         C         D   E
2018-03-30  1.306003 -0.519418 -0.011686 -0.559511   1
2018-03-31  0.659329 -0.354700  0.884170 -1.152383   2
2018-04-01  0.189717 -1.320098 -2.332286  1.030536   3
2018-04-02 -0.295454  1.159584 -0.888303 -0.476288   4
2018-04-03 -0.864901 -0.496578 -0.359946 -0.902925   8
2018-04-04 -0.754733  0.785901  0.965455  0.671031  10

In [7]:
df.loc[:,'D']=np.array([5]*6) #通过numpy
df

                   A         B         C  D   E
2018-03-30  1.306003 -0.519418 -0.011686  5   1
2018-03-31  0.659329 -0.354700  0.884170  5   2
2018-04-01  0.189717 -1.320098 -2.332286  5   3
2018-04-02 -0.295454  1.159584 -0.888303  5   4
2018-04-03 -0.864901 -0.496578 -0.359946  5   8
2018-04-04 -0.754733  0.785901  0.965455  5  10

In [8]:
len(df)

6

In [9]:
df.shape

(6, 5)

In [10]:
df2=df.copy()

In [11]:
df2==df

               A     B     C     D     E
2018-03-30  True  True  True  True  True
2018-03-31  True  True  True  True  True
2018-04-01  True  True  True  True  True
2018-04-02  True  True  True  True  True
2018-04-03  True  True  True  True  True
2018-04-04  True  True  True  True  True

In [12]:
id(df2)

2205163874232

In [13]:
id(df)

2205163605968

In [14]:
df2[df2>0]

                   A         B         C  D   E
2018-03-30  1.306003       NaN       NaN  5   1
2018-03-31  0.659329       NaN  0.884170  5   2
2018-04-01  0.189717       NaN       NaN  5   3
2018-04-02       NaN  1.159584       NaN  5   4
2018-04-03       NaN       NaN       NaN  5   8
2018-04-04       NaN  0.785901  0.965455  5  10